20230823071458-wireless_networking_technologies.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-01 Sun 15:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Wireless Networking Technologies</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Wireless Networking Technologies</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc1130f3">1. Specifications:</a></li>
<li><a href="#org858c264">2. 802.11 Frame</a>
<ul>
<li><a href="#orge56fd45">2.1. Frame Control Field</a></li>
<li><a href="#org8cbaefe">2.2. Duration Field</a></li>
<li><a href="#org38b8b96">2.3. 4 Address Fields (Each 6 Bytes long)</a>
<ul>
<li><a href="#orgc179edb">2.3.1. Source Address Field (MAC)</a></li>
<li><a href="#org24f4830">2.3.2. Intended Destination</a></li>
<li><a href="#org69fd323">2.3.3. Receiver Address</a></li>
<li><a href="#orgf71731b">2.3.4. Transmitter Address</a></li>
</ul>
</li>
<li><a href="#org529dcbd">2.4. Sequence Control Field</a></li>
<li><a href="#orgfdee617">2.5. Data Payload</a></li>
<li><a href="#orgf1b90eb">2.6. Frame Check Sequence</a></li>
</ul>
</li>
<li><a href="#org6e25f2b">3. Wireless Channels</a></li>
<li><a href="#org2aea724">4. Wireless Security</a></li>
</ul>
</div>
</div>
<p>
Defined by <code>IEEE 802.11</code> standards.
</p>

<p>
Most commonly the 2.4Ghz and 5Ghz <a href="20230823071657-frequency_band.html#ID-35766a1b-6bed-482a-b984-2493601f67da">Frequency Band</a>s.
</p>

<div id="outline-container-orgc1130f3" class="outline-2">
<h2 id="orgc1130f3"><span class="section-number-2">1.</span> Specifications:</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>802.11b</li>
<li>802.11a</li>
<li>802.11g</li>
<li>802.11n</li>
<li>802.11ac</li>
</ul>

<p>
802.11 : how we operate on both <a href="20230820072227-physical_layer.html#ID-4a16abe5-9d6e-41e7-ac14-457479594c80">1. Physical Layer</a> and <a href="20230820072332-data_link_layer.html#ID-a6d3f0e4-6871-401d-acea-0a58e4b6891a">2. Data Link Layer</a>s
</p>
</div>
</div>

<div id="outline-container-org858c264" class="outline-2">
<h2 id="org858c264"><span class="section-number-2">2.</span> 802.11 Frame</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orge56fd45" class="outline-3">
<h3 id="orge56fd45"><span class="section-number-3">2.1.</span> Frame Control Field</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<b>16 bits</b>
Contains a number of sub-fields that are used to describe how the frame itself should be processed. This includes things like what version of the 802.11 was used.
</p>
</div>
</div>

<div id="outline-container-org8cbaefe" class="outline-3">
<h3 id="org8cbaefe"><span class="section-number-3">2.2.</span> Duration Field</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Specifies how long the total frame is.
</p>
</div>
</div>

<div id="outline-container-org38b8b96" class="outline-3">
<h3 id="org38b8b96"><span class="section-number-3">2.3.</span> 4 Address Fields (Each 6 Bytes long)</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-orgc179edb" class="outline-4">
<h4 id="orgc179edb"><span class="section-number-4">2.3.1.</span> Source Address Field (MAC)</h4>
</div>
<div id="outline-container-org24f4830" class="outline-4">
<h4 id="org24f4830"><span class="section-number-4">2.3.2.</span> Intended Destination</h4>
</div>
<div id="outline-container-org69fd323" class="outline-4">
<h4 id="org69fd323"><span class="section-number-4">2.3.3.</span> <a href="20230823072413-receiver_address.html#ID-d2687c6f-4af2-41eb-8395-dc95295f9dcd">Receiver Address</a></h4>
</div>
<div id="outline-container-orgf71731b" class="outline-4">
<h4 id="orgf71731b"><span class="section-number-4">2.3.4.</span> <a href="20230823072442-transmitter_address.html#ID-c0c78426-8f4b-4feb-9bfc-4d9dfb6c871e">Transmitter Address</a></h4>
</div>
</div>

<div id="outline-container-org529dcbd" class="outline-3">
<h3 id="org529dcbd"><span class="section-number-3">2.4.</span> Sequence Control Field</h3>
<div class="outline-text-3" id="text-2-4">
<p>
<b>16 bits</b>
(In between <code>Receiver</code> and <code>Transmitter</code> Address Fields)
</p>

<p>
Contains a sequence number used to keep track of the ordering of frames after
</p>
</div>
</div>

<div id="outline-container-orgfdee617" class="outline-3">
<h3 id="orgfdee617"><span class="section-number-3">2.5.</span> Data Payload</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Has all of the data of the protocols further up the stack.
</p>
</div>
</div>

<div id="outline-container-orgf1b90eb" class="outline-3">
<h3 id="orgf1b90eb"><span class="section-number-3">2.6.</span> Frame Check Sequence</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Contains a checksum used for a cyclical redundancy check (just like how Ethernet does it)
</p>
</div>
</div>
</div>

<div id="outline-container-org6e25f2b" class="outline-2">
<h2 id="org6e25f2b"><span class="section-number-2">3.</span> <a href="20230823073246-wireless_channels.html#ID-46cb7c35-247b-417d-ba51-4a02e222e2cc">Wireless Channels</a></h2>
</div>
<div id="outline-container-org2aea724" class="outline-2">
<h2 id="org2aea724"><span class="section-number-2">4.</span> <a href="20230823073550-wireless_security.html#ID-4cf68bc9-1c91-41c0-9264-b85b5ea42c45">Wireless Security</a></h2>
</div>
</div>
</body>
</html>
